## Create a dataframe as followa using pandas

                                               Chemistry   Physics   Mathematics   English
                                    Subodh        67          45         50          19
                                    Ram           90          92         87          90
                                    Abdul         66          72         81          72
                                    John          32          40         12          68

In [9]:
import pandas as pd
import numpy as np
marks = {'Chemistry': [67,90,66,32], 
 'Physics': [45,92,72,40], 
 'Mathematics': [50,87,81,12], 
 'English': [19,90,72,68]}
marks_df = pd.DataFrame(marks, index = ['Subodh', 'Ram', 'Abdul', 'John'])
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

## The teacher wants to create a new column called total and the value of each row in total column should be the sum of all marks of ech student

In [10]:
marks_df['Total'] = marks_df['Chemistry'] + marks_df['Physics'] + marks_df['Mathematics'] + marks_df['English']
marks_df

        Chemistry  Physics  Mathematics  English  Total
Subodh         67       45           50       19    181
Ram            90       92           87       90    359
Abdul          66       72           81       72    291
John           32       40           12       68    152

## Drop the total column

In [11]:
marks_df.drop(columns = 'Total' , inplace = True)
marks_df

        Chemistry  Physics  Mathematics  English
Subodh         67       45           50       19
Ram            90       92           87       90
Abdul          66       72           81       72
John           32       40           12       68

## The teacher wants to award five bonus marks to all the students.

In [12]:
new_marks = marks_df + 5
new_marks

        Chemistry  Physics  Mathematics  English
Subodh         72       50           55       24
Ram            95       97           92       95
Abdul          71       77           86       77
John           37       45           17       73

## The teacher want increase the marks of all the students as follows-

- Chemistry: + 5 
- Physics: + 10
- Mathematics: + 10
- English: + 2

In [13]:
new_marks = marks_df + [5,10,10,2]
new_marks

        Chemistry  Physics  Mathematics  English
Subodh         72       55           60       21
Ram            95      102           97       92
Abdul          71       82           91       74
John           37       50           22       70

## The teacher wants to get the total marks scored in each subject

In [14]:
marks_df.apply(np.sum, axis = 0)

Chemistry      255
Physics        249
Mathematics    230
English        249
dtype: int64

## The teacher wants to get the total marks scored by each student.

In [15]:
marks_df.apply(np.sum, axis = 1)

Subodh    181
Ram       359
Abdul     291
John      152
dtype: int64

## The teacher wants to hide the marks of the students who scored less than 35 marks and display Fail in place of those marks.

In [16]:
f = marks_df < 35
marks_df.mask(f,'Fail')

       Chemistry  Physics Mathematics English
Subodh        67       45          50    Fail
Ram           90       92          87      90
Abdul         66       72          81      72
John        Fail       40        Fail      68